# Generic Zone Get Sketch Id Method

Source: https://www.revitapidocs.com/2026/abe387d4-22e1-6c40-69a2-d196b14aba58.htm

---

| Generic Zone Get Sketch Id Method |
| --- |

Gets the sketch id for the generic zone.
**Namespace:** Autodesk.Revit.DB.Analysis
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public ElementId GetSketchId()
```

```
Public Function GetSketchId As ElementId
```

```
public:
ElementId^ GetSketchId()
```

```
member GetSketchId : unit -> ElementId
```

#### Return Value

ElementId
The sketch element id for the sketch\-based generic zone. Exceptions

| Exception | Condition |
| --- | --- |
| InvalidOperationException | This generic zone must be sketch\-based. |

See Also

#### Reference

GenericZone Class Autodesk.Revit.DB.Analysis Namespace